Tested, unfortunatelly the resource is empty even tough the plan points otherwise.

Plan:
```
resource "netbox_virtual_machine" "vm" {
  name          = var.hostname
  site_id       = data.netbox_site.site.id
  cluster_id    = data.netbox_cluster.cluster.id
  tenant_id     = data.netbox_tenant.tenant.id
  role_id       = data.netbox_device_role.role.id
  platform_id   = data.netbox_platform.platform.id
  vcpus         = var.vcpu
  memory_mb     = var.memory * 1024
  disk_size_gb  = var.os_disk_size
  custom_fields = local.custom_fields
  # tags          = var.tags
  lifecycle {
    ignore_changes = [
      custom_fields
    ]
  }
  local_context_data = jsonencode({
    "setting1" = "Some Setting"
    "setting2" = 42
  })
}
```

Apply:
```
  # module.vmk["vmk-dev-intel-01"].netbox_virtual_machine.vm will be created
  + resource "netbox_virtual_machine" "vm" {
      + cluster_id         = 125
      + custom_fields      = {
          + "ConfigSrv"     = "core-00"
          + "Config_KSDisk" = ""
          + "provision_os"  = "rocky_8.7"
          + "puppet_env"    = "production"
        }
      + disk_size_gb       = 30
      + id                 = (known after apply)
      + local_context_data = jsonencode(
            {
              + setting1 = "Some Setting"
              + setting2 = 42
            }
        )
      + memory_mb          = 1024
      + name               = "vmk-dev-intel-01"
      + platform_id        = 5
      + primary_ipv4       = (known after apply)
      + primary_ipv6       = (known after apply)
      + role_id            = 8
      + site_id            = 3
      + status             = "active"
      + tenant_id          = 26
      + vcpus              = 1
    }
    ```
    
Netbox:
![image](https://github.com/e-breuninger/terraform-provider-netbox/assets/584882/3089cda2-3d9f-47b8-82fc-1c2b690877d2)

I have tried without custom_fields with no success.

```
  # module.vmk["vmk-dev-intel-01"].netbox_virtual_machine.vm will be created
  + resource "netbox_virtual_machine" "vm" {
      + cluster_id         = 125
      + disk_size_gb       = 30
      + id                 = (known after apply)
      + local_context_data = jsonencode(
            {
              + setting1 = "Some Setting"
              + setting2 = 42
            }
        )
      + memory_mb          = 1024
      + name               = "vmk-dev-intel-01"
      + platform_id        = 5
      + primary_ipv4       = (known after apply)
      + primary_ipv6       = (known after apply)
      + role_id            = 8
      + site_id            = 3
      + status             = "active"
      + tenant_id          = 26
      + vcpus              = 1
    }
    ```
Netbox:
![image](https://github.com/e-breuninger/terraform-provider-netbox/assets/584882/3089cda2-3d9f-47b8-82fc-1c2b690877d2)